app/views/projects/show.html.erb

        <tbody>
          <% if @project.tasks.any? %>
        <% @project.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."project_id" = ? LIMIT ?  [["project_id", 1], ["LIMIT", 1]]