app/controllers/projects_controller.rb

  def index
    @projects = current_user.projects
    @projects = [] if @projects.nil?

    @projects = @projects.where("title ILIKE ?", "%#{params[:search]}%") if params[:search].present?

    @projects = case params[:sort]
                when 'title' then @projects.order(:title)
                when 'start_date' then @projects.order(:start_date)
                when 'progress' then @projects.order(:progress)
                else @projects.order(created_at: :desc)
                end

    @projects = @projects.page(params[:page]).per(10)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "projects" WHERE "projects"."user_id" = ? AND (title ILIKE '%k%') ORDER BY "projects"."created_at" DESC LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
SELECT "projects".* FROM "projects"

  def create


     @project = current_user.projects.build(project_params)
     puts "@project.inspect: #{@project.inspect}"
    puts "project_params: #{project_params.inspect}"
    if @project.save
---
INSERT INTO "projects" ("title", "description", "start_date", "end_date", "created_at", "updated_at", "progress", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "updated_at" = ? WHERE "projects"."id" = ?  [["updated_at", "2024-09-02 20:56:19.972684"], ["id", 7]]

  def set_project
    @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]