app/controllers/tasks_controller.rb

  def create
    @task = @project.tasks.build(task_params)
    @task.user = current_user || User.first
    if @task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "due_date", "status", "project_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "Blocked"], ["updated_at", "2024-12-13 15:00:43.315671"], ["id", 71]]

  def set_project
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def set_task
    @task = @project.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 15], ["id", 71], ["LIMIT", 1]]