app/controllers/wiki_controller.rb

SELECT "wiki_pages".* FROM "wiki_pages" ORDER BY "wiki_pages"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def main
    @latest_wiki_page = WikiPage.order(updated_at: :desc).first

SELECT "wiki_pages".* FROM "wiki_pages" ORDER BY "wiki_pages"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @wiki_pages = WikiPage.all

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @wiki_page = WikiPage.find(params[:id])

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_wiki_page
    @wiki_page = WikiPage.find(params[:id])