app/models/task.rb

UPDATE "projects" SET "updated_at" = ?, "progress" = ? WHERE "projects"."id" = ?  [["updated_at", "2024-08-30 21:08:36.344943"], ["progress", nil], ["id", 3]]
---
  def update_project_progress
    project.save