app/views/layouts/application.html.erb

                <% if current_user %>
                <% current_user.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]