app/views/layouts/application.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
---
              <ul class="nav flex-column mb-2 project-list">
                <% current_user.projects.each do |project| %>